---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopYProjection
source: html/27cc8cb5-a922-56cc-844e-ce2f85ae361c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopYProjection Property

"Top y Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelTopYProjection { get; }
```